bases/WIM_FIn/projects/IMDEV-8772 Устранить отмену проведение и повторное проведение Сделки/VTB_ExchangeDU/InformationRegisters/ExchDU_СостояниеОбъектовЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ExchDU_СостояниеОбъектовЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоБП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПотока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-8772 Устранить отмену проведение и повторное проведение Сделки/VTB_ExchangeDU/Enums/ExchDU_СостояниеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ExchDU_СостояниеОбработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
					<Comment>Обрабатывается после загрузки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-8772 Устранить отмену проведение и повторное проведение Сделки/VTB_ExchangeDU/CommonModules/ExchDU_ОбработкаОбъектовПослеЗагрузки/Ext/Module.bsl
Функция XML(Данные) Экспорт 
    
    ЗаписьXML = Новый ЗаписьXML();
    ЗаписьXML.УстановитьСтроку();
    СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Данные);
    
    Возврат ЗаписьXML.Закрыть();
    
КонецФункции

Функция ДанныеИзXML(Стр) Экспорт
    
    ЧтениеXML = Новый ЧтениеXML();
    ЧтениеXML.УстановитьСтроку(Стр);
    
    Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML); 
    
КонецФункции

#Область ОптимизацияПоПортфелям

// Выполняет операции с документами в фоновом режиме с разбивкой по портфелям для больших объемов данных.
// Цель: Оптимизировать обработку больших данных, минимизировать таймауты и нагрузку на сервер.
//
// Параметры:
//  ДанныеXML          - Строка - XML-строка с таблицей документов.
//  ИдентификаторПотока - Строка - Уникальный идентификатор потока.
//  ПараметрыОбработки - Структура - Настройки обработки (ПорогПерекоса, МаксЗаданий, МаксВремяЗадания, МаксВремяОбщее, ПорогАктивныхЗаданий, ВыполнятьЗавершающиеДействия).
//
Процедура ВыполнениеОперацийСДокументамиБП(ДанныеXML, ИдентификаторПотока, ПараметрыОбработки = Неопределено) Экспорт
	
	// Установка параметров по умолчанию.
	Настройки = Новый Структура;
	Настройки.Вставить("ПорогПерекоса", 1000);
	Настройки.Вставить("МаксЗаданий", 15); // +++ Увеличен лимит до 15 заданий
	Настройки.Вставить("МаксВремяЗадания", 14400); // 4 часа
	Настройки.Вставить("МаксВремяОбщее", 12 * 3600); // 12 часов
	Настройки.Вставить("ПорогАктивныхЗаданий", 50);
	Настройки.Вставить("ВыполнятьЗавершающиеДействия", Истина);
	Если ПараметрыОбработки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Настройки, ПараметрыОбработки);
	КонецЕсли;
	
	// Преобразование XML в таблицу значений.
	ИмяСобытияЖР = "Портфели потока [" + ИдентификаторПотока + "]";
	Попытка
		ТЗДокументыБП = ДанныеИзXML(ДанныеXML);
	Исключение
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , ,
		"Ошибка преобразования XML: " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	// Проверка количества активных фоновых заданий.
	АктивныеЗадания = 0;
	Попытка
		СостояниеФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Состояние", СостояниеФоновогоЗадания.Активно));
		АктивныеЗадания = СостояниеФоновыхЗаданий.Количество();
	Исключение
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , ,
		"Ошибка проверки активных фоновых заданий: " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Если ТЗДокументыБП.Количество() < Настройки.ПорогПерекоса Или АктивныеЗадания >= Настройки.ПорогАктивныхЗаданий Тогда
		// Прямая обработка для малого объема данных или при высокой нагрузке сервера.
		Если АктивныеЗадания >= Настройки.ПорогАктивныхЗаданий Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Предупреждение, , ,
			"Слишком много активных фоновых заданий (" + АктивныеЗадания + "), используется последовательная обработка несмотря на " +
			"превышение порога в " + Настройки.ПорогПерекоса + " строк.");
		КонецЕсли;
		
		Для Каждого СтрокаДанные Из ТЗДокументыБП Цикл
			Попытка
				Выполнить("Выполнение_" + СтрокаДанные.ИмяОперации + "(СтрокаДанные)");
			Исключение
				ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , ,
				"Ошибка выполнения операции " + СтрокаДанные.ИмяОперации + ": " +
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Продолжить;
			КонецПопытки;
		КонецЦикла;
	Иначе
		// Проверка состояния сервера для определения допустимого количества заданий.
		ДопустимоеКоличествоЗаданий = Мин(Настройки.МаксЗаданий, Макс(5, 20 - АктивныеЗадания / 10));
		
		// Создание массива для отслеживания фоновых заданий.
		МассивФоновыхЗаданий = Новый Массив;
		
		// Массив для накопления заданий с ошибками.
		МассивЗаданийСОшибкой = Новый Массив;
		
		// Создание менеджера временных таблиц.
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Помещение таблицы во временную таблицу.
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.РегСвед КАК РегСвед,
		|	Таблица.Измерение КАК Измерение,
		|	Таблица.ИмяОперации КАК ИмяОперации,
		|	Таблица.ОбъектДляОперации КАК ОбъектДляОперации,
		|	Таблица.Портфель КАК Портфель,
		|	Таблица.ИдентификаторПотока КАК ИдентификаторПотока,
		|	Таблица.ПройденныеШаги КАК ПройденныеШаги
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	&Таблица КАК Таблица";
		Запрос.УстановитьПараметр("Таблица", ТЗДокументыБП);
		Запрос.Выполнить();
		
		// Получение уникального списка портфелей через запрос.
		// Добавлен подсчет количества объектов по каждому портфелю и сортировка по убыванию количества
		// для запуска заданий от самых больших портфелей к самым маленьким - это позволит
		// запустить длительные операции раньше, потенциально сократив общее время ожидания завершения всех заданий.
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_Документы.Портфель КАК Портфель,
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Документы.Портфель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Количество УБЫВ";
		ТЗПортфели = Запрос.Выполнить().Выгрузить();
		
		// Индексация таблицы для ускорения поиска.
		ТЗДокументыБП.Индексы.Добавить("Портфель");
		
		// Разделение данных по портфелям и запуск фоновых заданий.
		Для Каждого СтрПортфель Из ТЗПортфели Цикл
			// Фильтрация строк через запрос.
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВТ_Документы.РегСвед КАК РегСвед,
			|	ВТ_Документы.Измерение КАК Измерение,
			|	ВТ_Документы.ИмяОперации КАК ИмяОперации,
			|	ВТ_Документы.ОбъектДляОперации КАК ОбъектДляОперации,
			|	ВТ_Документы.Портфель КАК Портфель,
			|	ВТ_Документы.ИдентификаторПотока КАК ИдентификаторПотока,
			|	ВТ_Документы.ПройденныеШаги КАК ПройденныеШаги
			|ИЗ
			|	ВТ_Документы КАК ВТ_Документы
			|ГДЕ
			|	ВТ_Документы.Портфель = &Портфель";
			Запрос.УстановитьПараметр("Портфель", СтрПортфель.Портфель);
			ТЗДокументыБППоПотоку = Запрос.Выполнить().Выгрузить();
			
			// Расчет динамической паузы.
			КоличествоОбъектов = СтрПортфель.Количество;
			Если КоличествоОбъектов <= 10 Тогда
				ПаузаСек = 0.1;
			ИначеЕсли КоличествоОбъектов >= 1000 Тогда
				ПаузаСек = 5;
			ИначеЕсли КоличествоОбъектов >= 100 Тогда
				ПаузаСек = 3;
			Иначе
				ПаузаСек = 0.1 + (КоличествоОбъектов - 10) * (3 - 0.1) / (100 - 10);
			КонецЕсли;
			ПаузаСек = Окр(ПаузаСек, 3);
			
			// Преобразование таблицы в XML для передачи в фоновое задание.
			Попытка
				ДанныеXMLПоПотоку = ExchDU_ОбработкаОбъектовПослеЗагрузки.XML(ТЗДокументыБППоПотоку);
			Исключение
				ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , СтрПортфель.Портфель,
				"Ошибка преобразования таблицы в XML для портфеля " + СтрПортфель.Портфель + ": " +
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Продолжить;
			КонецПопытки;
			
			// Подготовка параметров для фонового задания.
			ПараметрыФоновогоЗадания = Новый Массив;
			ПараметрыФоновогоЗадания.Добавить(ДанныеXMLПоПотоку);
			
			// Запуск фонового задания.
			Попытка
				Задание = ФоновыеЗадания.Выполнить(
				"ExchDU_ОбработкаОбъектовПослеЗагрузки.ВыполнениеПоПортфелямОперацийСДокументамиБП",
				ПараметрыФоновогоЗадания,
				ИдентификаторПотока + "_" + Строка(СтрПортфель.Портфель),
				ИмяСобытияЖР + " (" + СтрПортфель.Портфель + ")");
			Исключение
				ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , СтрПортфель.Портфель,
				"Ошибка запуска фонового задания для портфеля " + СтрПортфель.Портфель + ": " +
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Продолжить;
			КонецПопытки;
			
			// Логирование запуска.
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация, , СтрПортфель.Портфель,
			"Запущено фоновое задание для портфеля: " + СтрПортфель.Портфель + ", строк: " + КоличествоОбъектов +
			", ключ: " + ИдентификаторПотока + "_" + Строка(СтрПортфель.Портфель));
			
			// Добавление информации о задании.
			НоваяЗапись = Новый Структура;
			НоваяЗапись.Вставить("Портфель", СтрПортфель.Портфель);
			НоваяЗапись.Вставить("ФоновоеЗадание", Задание);
			НоваяЗапись.Вставить("Завершен", Ложь);
			НоваяЗапись.Вставить("Отказ", Ложь);
			НоваяЗапись.Вставить("ТекстОшибки", "");
			НоваяЗапись.Вставить("ПаузаСекунды", ПаузаСек);
			НоваяЗапись.Вставить("ВремяЗапуска", ТекущаяДатаСеанса());
			МассивФоновыхЗаданий.Добавить(НоваяЗапись);
			
			// Ожидание с учетом текущей нагрузки.
			ОжидатьЗавершенияФоновыхЗаданий(ИмяСобытияЖР, МассивФоновыхЗаданий, ДопустимоеКоличествоЗаданий, Настройки, МассивЗаданийСОшибкой);
			
		КонецЦикла;
		
		// Ожидание завершения всех заданий.
		ОжидатьЗавершенияФоновыхЗаданий(ИмяСобытияЖР, МассивФоновыхЗаданий, 0, Настройки, МассивЗаданийСОшибкой);
		
		// Проверка ошибок из накопленного массива.
		Для Каждого Задание Из МассивЗаданийСОшибкой Цикл
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , Задание.Портфель,
			"Фоновое задание для портфеля " + Задание.Портфель + " завершилось с ошибкой: " + Задание.ТекстОшибки);
		КонецЦикла;
		
		// Логирование завершения.
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация, , ,
		"Завершена обработка документов по портфелям в фоновом режиме");
		
		// Очистка менеджера временных таблиц.
		МенеджерВременныхТаблиц.Закрыть();
	КонецЕсли;
	
	// Завершающие действия (если разрешены).
	Если Настройки.ВыполнятьЗавершающиеДействия Тогда
		// Установка статуса завершения.
		УстановкаСостоянияПотока(ИдентификаторПотока, Перечисления.ExchDU_СостояниеОбработки.Обработан);
		
		// Запуск сделок FX (IMDEV-5292, N.Filimonova, 17.11.2023).
		СтартСделокFX(ИдентификаторПотока);
	КонецЕсли;
	
КонецПроцедуры

// Ожидает завершения фоновых заданий с учетом текущей нагрузки сервера.
// Цель: Обеспечить завершение заданий с минимальной нагрузкой и обработкой ошибок.
//
// Параметры:
//  ИмяСобытияЖР               - Строка - Имя события для журнала регистрации.
//  МассивФоновыхЗаданий       - Массив - Массив структур с информацией о заданиях.
//  МаксКоличествоВОжидании    - Число - Максимум одновременно выполняемых заданий.
//  Настройки                  - Структура - Параметры обработки (МаксВремяЗадания, МаксВремяОбщее).
//  МассивЗаданийСОшибкой      - Массив - Массив для накопления заданий с ошибками (по ссылке).
//
Процедура ОжидатьЗавершенияФоновыхЗаданий(ИмяСобытияЖР,
	МассивФоновыхЗаданий,
	МаксКоличествоВОжидании,
	Настройки,
	МассивЗаданийСОшибкой = Неопределено)
	
	ОбщееВремяОжиданияЗавершенияФоновых = 0;
	
	Пока Истина Цикл
		КоличествоНеЗавершенных = 0;
		НовыйМассивФоновыхЗаданий = Новый Массив;
		
		// Проверка состояния каждого задания.
		Для Каждого ТекущееЗадание Из МассивФоновыхЗаданий Цикл
			Если ТекущееЗадание.Завершен Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоНеЗавершенных = КоличествоНеЗавершенных + 1;
			
			ЗаданиеЕстьОшибкиВыполнения = Ложь;
			ОписаниеОшибки = "";
			
			// Проверка времени выполнения задания.
			Если ТекущаяДатаСеанса() - ТекущееЗадание.ВремяЗапуска > Настройки.МаксВремяЗадания Тогда
				Попытка
					ТекущееЗадание.ФоновоеЗадание.Отменить();
					ЗаданиеЕстьОшибкиВыполнения = Истина;
					ОписаниеОшибки = "Задание превысило максимальное время выполнения (" + Настройки.МаксВремяЗадания + " сек).";
				Исключение
					ОписаниеОшибки = "Ошибка при попытке отмены задания: " +
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				КонецПопытки;
			Иначе
				Попытка
					ЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ТекущееЗадание.ФоновоеЗадание.УникальныйИдентификатор);
				Исключение
					ЗаданиеЕстьОшибкиВыполнения = Истина;
					ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				КонецПопытки;
			КонецЕсли;
			
			// Обработка ошибок или завершения.
			Если ЗаданиеЕстьОшибкиВыполнения Тогда
				ТекущееЗадание.Завершен = Истина;
				ТекущееЗадание.Отказ = Истина;
				ТекущееЗадание.ТекстОшибки = ОписаниеОшибки;
			ИначеЕсли ЗаданиеВыполнено Тогда
				ТекущееЗадание.Завершен = Истина;
			КонецЕсли;
			
			// Логирование завершения.
			Если ТекущееЗадание.Завершен Тогда
				ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Информация, , ТекущееЗадание.Портфель,
				"Завершено фоновое задание для портфеля: " + ТекущееЗадание.Портфель +
				?(ТекущееЗадание.Отказ, " с ошибкой: " + ТекущееЗадание.ТекстОшибки, ""));
				
				// Добавление задания с ошибкой в массив.
				Если ТекущееЗадание.Отказ И МассивЗаданийСОшибкой <> Неопределено Тогда
					МассивЗаданийСОшибкой.Добавить(ТекущееЗадание);
				КонецЕсли;
			Иначе
				НовыйМассивФоновыхЗаданий.Добавить(ТекущееЗадание);
			КонецЕсли;
		КонецЦикла;
		
		// Обновление массива.
		МассивФоновыхЗаданий = НовыйМассивФоновыхЗаданий;
		
		// Проверка завершения.
		Если КоличествоНеЗавершенных < МаксКоличествоВОжидании Или КоличествоНеЗавершенных = 0 Тогда
			Прервать;
		КонецЕсли;
		
		// Расчет динамической паузы.
		МинПаузаСек = 3;
		Для Каждого ТекЗадание Из МассивФоновыхЗаданий Цикл
			Если ТекЗадание.ПаузаСекунды < МинПаузаСек Тогда
				МинПаузаСек = ТекЗадание.ПаузаСекунды;
			КонецЕсли;
		КонецЦикла;
		Если МинПаузаСек < 0.1 Тогда
			МинПаузаСек = 0.1;
		КонецЕсли;
		
		// Пауза.
		ВызватьПаузу(МинПаузаСек * 1000);
		ОбщееВремяОжиданияЗавершенияФоновых = ОбщееВремяОжиданияЗавершенияФоновых + МинПаузаСек;
		
		// Проверка общего времени.
		Если ОбщееВремяОжиданияЗавершенияФоновых > Настройки.МаксВремяОбщее Тогда
			Для Каждого ТекущееЗадание Из МассивФоновыхЗаданий Цикл
				Попытка
					ТекущееЗадание.ФоновоеЗадание.Отменить();
					ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , ТекущееЗадание.Портфель,
					"Задание для портфеля " + ТекущееЗадание.Портфель + " отменено из-за превышения времени ожидания.");
				Исключение
					ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка, , ТекущееЗадание.Портфель,
					"Ошибка отмены задания для портфеля " + ТекущееЗадание.Портфель + ": " +
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
			КонецЦикла;
			ВызватьИсключение "Превышено максимальное время ожидания завершения фоновых заданий.";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Выполняет операции с документами для одного портфеля в фоновом режиме.
// Цель: Обеспечить атомарную обработку данных по портфелю с минимальными конфликтами.
//
// Параметры:
//  ДанныеXML - Строка - XML-строка с таблицей документов для портфеля.
//
Процедура ВыполнениеПоПортфелямОперацийСДокументамиБП(ДанныеXML) Экспорт
	
	// Получение таблицы из XML.
	Попытка
		ТаблицаБПДокументыПоПортфелю = ДанныеИзXML(ДанныеXML);
	Исключение
		ЗаписьЖурналаРегистрации("Обработка портфеля", УровеньЖурналаРегистрации.Ошибка, , ,
		"Ошибка преобразования XML в таблицу: " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	// Пакетная обработка строк (по 1000 строк) без транзакций.
	РазмерПакета = 1000;
	КоличествоСтрок = ТаблицаБПДокументыПоПортфелю.Количество();
	КоличествоПакетов = Цел((КоличествоСтрок + РазмерПакета - 1) / РазмерПакета);
	
	Для НомерПакета = 1 По КоличествоПакетов Цикл
		НачалоПакета = (НомерПакета - 1) * РазмерПакета;
		КонецПакета = Мин(НачалоПакета + РазмерПакета - 1, КоличествоСтрок - 1);
		
		// Обработка строк пакета без транзакции.
		Для Индекс = НачалоПакета По КонецПакета Цикл
			Попытка
				СтрокаДанные = ТаблицаБПДокументыПоПортфелю[Индекс];
				Выполнить("Выполнение_" + СтрокаДанные.ИмяОперации + "(СтрокаДанные)");
			Исключение
				ЗаписьЖурналаРегистрации("Обработка портфеля", УровеньЖурналаРегистрации.Ошибка, , ,
				"Ошибка обработки строки " + (Индекс + 1) + ": " +
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Продолжить;
			КонецПопытки;
		КонецЦикла;
		
		// Логирование прогресса только для непустых пакетов и если пакетов больше одного.
		Если КоличествоПакетов > 1 И КонецПакета >= НачалоПакета Тогда
			ЗаписьЖурналаРегистрации("Обработка портфеля", УровеньЖурналаРегистрации.Информация, , ,
			"Обработан пакет №" + НомерПакета + ": " + (КонецПакета - НачалоПакета + 1) + 
			" строк, всего обработано: " + (КонецПакета + 1) + " из " + КоличествоСтрок + " строк");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
Процедура СтартСделокFX(ИдентификаторПотока)
//{[+] IMDEV-5292 N.Filimonova 17.11.2023
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ExchDU_СписокДокументовДляПроведения.ДокументДляПроведения КАК ДокументДляПроведения
		|ИЗ
		|	РегистрСведений.ExchDU_СписокДокументовДляПроведения КАК ExchDU_СписокДокументовДляПроведения
		|ГДЕ
		|	ExchDU_СписокДокументовДляПроведения.ДокументДляПроведения ССЫЛКА Документ.СделкаНаВалютномРынке
		|	И ExchDU_СписокДокументовДляПроведения.ИдентификаторПотока = &ИдентификаторПотока";
	
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);

	СделкиНаВалютномРынке = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументДляПроведения");
	
	ВнешняяОбработкаИсполненияСделокFX = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Исполнение сделок FX");	
	ОбъектОбработкиИсполнения = ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(ВнешняяОбработкаИсполненияСделокFX); 
	
	Отказ = Ложь;
	ТекстСообщения = "";
	ТекстРассылки = "";
	БылиОшибки = Ложь;
	
	СозданныеДокументы = ОбъектОбработкиИсполнения.СоздатьПерезаполнитьОперацииПоДокументуОснованию(СделкиНаВалютномРынке, БылиОшибки, ТекстСообщения, Истина, Ложь, Ложь);
	
	Для Каждого ДокументСтруктура Из СозданныеДокументы Цикл 
		Документ = ДокументСтруктура.Документ; 
		Если Документ.Дата <= КонецДня(ТекущаяДата()) Тогда
			ДокументОбъект = Документ.ПолучитьОбъект();   
			ЗаписатьДокумент(ДокументОбъект, СозданныеДокументы, РежимЗаписиДокумента.Проведение, ТекстСообщения, БылиОшибки);
		КонецЕсли;
	КонецЦикла;   
	
	
	Если БылиОшибки Тогда
		Уровень = УровеньЖурналаРегистрации.Ошибка;
		Комментарий = "Во время исполнения плановых позиций произошла ошибка";
	Иначе
		Уровень = УровеньЖурналаРегистрации.Информация;
		Комментарий = "Исполнение плановых позиций выполнено успешно";
	КонецЕсли;
		
	// Запись в журнал регистрации
	Комментарий = Комментарий + Символы.ПС + Комментарий;
	ЗаписьЖурналаРегистрации("Запуск операций после обмена ДУ->ФИН. Фоновое исполнение сделок FX", Уровень, , , Комментарий);   
	
	Задача 					= Задачи.ЗадачаИнтеграции.СоздатьЗадачу();
	Задача.Дата 			= ТекущаяДата();
	Задача.ВидОбмена 		= "Запуск операций после обмена ДУ->ФИН";
	Задача.Наименование 	= "Исполнение сделок FX" + Комментарий;
	Задача.Описание =  ТекстСообщения;
	Задача.ВыполнитьЗадачу();
	
	//} IMDEV-5292 N.Filimonova
КонецПроцедуры

Процедура ЗаписатьДокумент(ДокументОбъект, СозданныеДокументы, РежимЗаписи, ТекстСообщения, БылиОшибки)
	//{[+] IMDEV-5292 N.Filimonova 17.11.2023
	
	Комментарий = "";
	Статус = ?(ЗначениеЗаполнено(ДокументОбъект.Ссылка), "Перезаполнен", "Создан") + "(проведен)";
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписи);
	Исключение 
		БылиОшибки = Истина;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("Не удалось провести документ: %1. Записан. Требуется ручная корректировка. Техническая информация: %2", ДокументОбъект.Ссылка, ОписаниеОшибки());
		Исключение
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("Не удалось записать документ: %1. Записан. Требуется ручная корректировка. Техническая информация: %2", ДокументОбъект.Ссылка, ОписаниеОшибки());
		КонецПопытки;
		Статус = ?(ЗначениеЗаполнено(ДокументОбъект.Ссылка), "Перезаполнен", "Создан")+ "(записан)";
		Комментарий = ТекстСообщения;  
		
	КонецПопытки;
	
	//} IMDEV-5292 N.Filimonova
КонецПроцедуры


Процедура ВыполнениеОперацийСоСправочниками(ТаблицаСправочников) Экспорт 
	
	Для Каждого СтрокаДанные Из ТаблицаСправочников Цикл
		Если Не ЗначениеЗаполнено(СтрокаДанные.ОбъектДляОперации) Тогда
			Продолжить;
		КонецЕсли;
				
		Выполнить("Выполнение_"+СтрокаДанные.ИмяОперации+"(СтрокаДанные)");	
	КонецЦикла;
	
КонецПроцедуры   

Процедура ЗапускОперацийПослеОбмена(ИдентификаторОбмена) Экспорт
	
	ОбработкаЗапускОперацийПослеОбмена = Обработки.ExchDU_ЗапускОперацийПослеОбмена.Создать();
	
	//{[+] IMDEV-3254 N.Filimonova 18.02.2022
	ОбработкаЗапускОперацийПослеОбмена.ИдентификаторОбмена = ИдентификаторОбмена;
	//} IMDEV-3254 N.Filimonova
	
	Задача = Задачи.ЗадачаИнтеграции.СоздатьЗадачу();
	Задача.Дата 			= ТекущаяДатаСеанса();
	Задача.ВидОбмена 		= ОбработкаЗапускОперацийПослеОбмена;
	Задача.Наименование 	= "Обработки объектов после загрузки из DU";
	
	Отказ = Ложь;
	ТекстОшибки = "";
	
	Попытка
		ОбработкаЗапускОперацийПослеОбмена.ВыполнитьОбработку();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Отказ = Истина;
		Сообщить(ТекстОшибки);
	КонецПопытки;
	
	Задача.Описание = "";
	Задача.ХранилищеЛога = Новый ХранилищеЗначения(ОбработкаЗапускОперацийПослеОбмена.Лог, Новый СжатиеДанных(9));
	
	Если Отказ Тогда
		Задача.Описание = "Ошибки выполнения:" + Символы.ПС + ТекстОшибки;
		Задача.ЗавершеноСОшибками = Истина;
	Иначе
		Задача.Описание = "Загрузка успешна";
	КонецЕсли;
	
	Задача.ДатаИсполнения = ТекущаяДатаСеанса();
	Задача.ВыполнитьЗадачу();
	
КонецПроцедуры

Процедура Выполнение_ПроведениеДокументовПослеЗагрузки(СтрокаДанные)

	ДокументСсылка = СтрокаДанные.ОбъектДляОперации;
	ИдентификаторПотока = СтрокаДанные.ИдентификаторПотока; 
	Ошибки = Ложь; 
	
	Попытка
		Действие = ?(ДокументСсылка.Проведен, "Перепроведен", "Проведен"); 
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Если ДокументОбъект.ПометкаУдаления Тогда
			ДокументОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить(Действие + " документ """ + ДокументСсылка + """" + " " + ТекущаяДата());
		
		//{[+] IMDEV-5292 N.Filimonova 17.11.2023
		// Старт сделок на валютном рынке	
		
		//} IMDEV-5292 N.Filimonova
		
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось провести документ """ + ДокументСсылка + """ по причине: " + ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
	КонецПопытки;   
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке);

КонецПроцедуры //Выполнение_ПроведениеДокументовПослеЗагрузки()

Процедура Выполнение_ДокументДляОтменыПроведения(СтрокаДанные)
	
	ДокументСсылка = СтрокаДанные.ОбъектДляОперации;
	ИдентификаторПотока = СтрокаДанные.ИдентификаторПотока; 
	Ошибки = Ложь; 
	
	Попытка
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Если ДокументСсылка.ПометкаУдаления Тогда
			Действие = "Пометка удаления";
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
		Иначе
			Действие = "Отмена проведения";
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		Сообщить(Действие+" документ """+ДокументСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось отменить проведение документа """+ДокументСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина; 
	КонецПопытки;
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке);
	
КонецПроцедуры //Выполнение_ДокументДляОтменыПроведения()

Процедура Выполнение_ЗаписьНепроведенныхДокументовПослеЗагрузки(СтрокаДанные)
	
	ДокументСсылка = СтрокаДанные.ОбъектДляОперации;
	ИдентификаторПотока = СтрокаДанные.ИдентификаторПотока; 
	Ошибки = Ложь;
	
	Попытка
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Записан документ """+ДокументСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось Записать документ """+ДокументСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
	КонецПопытки;
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке);

КонецПроцедуры //Выполнение_ЗаписьНепроведенныхДокументовПослеЗагрузки()

Процедура Выполнение_ЗаписьСправочниковПослеЗагрузки(СтрокаДанные)
	
	СправочникСсылка = СтрокаДанные.ОбъектДляОперации;
	
	ТипЭлемента = Строка(СправочникСсылка.Метаданные().Имя);
	Ошибки = Ложь;
	Попытка
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.Записать();
		Сообщить("Записан элемент Справочника " + ТипЭлемента + " " + СправочникСсылка+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось Записать элемент Справочника " + ТипЭлемента + " " + СправочникСсылка + " по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
	КонецПопытки;
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке);

КонецПроцедуры // Выполнение_ЗаписьСправочниковПослеЗагрузки()

Процедура Выполнение_УдалениеДокументовПослеЗагрузки(СтрокаДанные)
	
	ДокументСсылка = СтрокаДанные.ОбъектДляОперации;
	ИдентификаторПотока = СтрокаДанные.ИдентификаторПотока; 
	Ошибки = Ложь;
	
	Попытка
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Действие = "Пометка удаления";
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
		Сообщить("Помечен на удаление документ """+ДокументСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось отменить проведение документа """+ДокументСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
	КонецПопытки; 
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке);

КонецПроцедуры // Выполнение_УдалениеДокументовПослеЗагрузки()

Процедура Выполнение_ЗаписьНовыхБППослеЗагрузки(СтрокаДанные)
	
	БПСсылка 	= СтрокаДанные.ОбъектДляОперации;
	ТипБП 		= БПСсылка.Метаданные().Имя;
	Ошибки 		= Ложь; 
	
	Попытка
		БПОбъект = БПСсылка.ПолучитьОбъект();
		БПОбъект.Записать();
		Сообщить("Записан бизнес-процесс """+БПСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось записать бизнес-процесс """+БПСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
		
		////////// VTB-Borisov  - 18.04.2019 { 
		//////////какая-то непонятная ситуация когда в приемнике нет объекта по ссылке. 
		//////////пока делаем костыль
		////////Если Найти(ТекстСообщенияОбОшибке, "Объект не найден") <> 0 Тогда
		////////	Возврат;
		////////КонецЕсли;
		////////// VTB-Borisov  - 18.04.2019 }

	КонецПопытки;	

	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке);

КонецПроцедуры // Выполнение_ЗаписьНовыхБППослеЗагрузки()

Функция ПолучитьТекущиеШагиБП(БПСсылка, ЗавершенныеШаги)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БизнесПроцесс", БПСсылка);
	Запрос.УстановитьПараметр("ЗавершенныеШаги", ЗавершенныеШаги);  // AVANCORE  - 18.10.2017
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВнебиржеваяСделка.ТочкаМаршрута КАК ТочкаМаршрутаСсылка,
		|	ВнебиржеваяСделка.ДатаИсполнения,
		|	ВнебиржеваяСделка.ТочкаМаршрута.Представление КАК ТочкаМаршрута
		|ИЗ
		|	Задача.ВнебиржеваяСделка КАК ВнебиржеваяСделка
		|ГДЕ
		|	ВнебиржеваяСделка.БизнесПроцесс = &БизнесПроцесс
		|	И ВнебиржеваяСделка.Выполнена = &ЗавершенныеШаги  
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВнебиржеваяСделка.ДатаИсполнения";

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		ТекущиеТочки = Новый Массив;
	КонецЕсли;
	
	ТаблицаТочек = Результат.Выгрузить();     // AVANCORE - 13.08.2017 
	ТекущиеТочки = ТаблицаТочек.ВыгрузитьКолонку("ТочкаМаршрута");
// AVANCORE  - 14.04.2017 }	

	Возврат ТекущиеТочки;
	
КонецФункции // ПолучитьТекущиеШагиБП()

Функция ПолучитьШагиБПДляЗакрытия(ТипБП)

	МассивШагов = Новый Массив;

	Если ТипБП = "ВнебиржеваяСделка" Тогда
		
		МассивШагов.Добавить("УстановкаНастроекБП");
		МассивШагов.Добавить("ОткрытиеПлановойПозиции");
		МассивШагов.Добавить("ПеречислитьАвансБрокер");
		МассивШагов.Добавить("ОплатаСделкиБанк");
		МассивШагов.Добавить("ОплатаКомиссииБрокера");
		МассивШагов.Добавить("ОплатаИнойКомиссии");
		МассивШагов.Добавить("Валютирование");
		МассивШагов.Добавить("РезервированиеРасходов");
		МассивШагов.Добавить("ОформитьДопРасходы");
		МассивШагов.Добавить("ОформитьСделку");
		
	ИначеЕсли ТипБП = "СделкиTn"  Тогда
		
		МассивШагов.Добавить("УстановкаНастроекБП");
		МассивШагов.Добавить("ОткрытиеПлановойПозиции");
		МассивШагов.Добавить("ОплатаСделки");
		МассивШагов.Добавить("ОплатаКомиссииБрокера");
		МассивШагов.Добавить("ОплатаКомиссииБиржи");
		МассивШагов.Добавить("Валютирование");
		МассивШагов.Добавить("ЗакрытиеПлановойПозиции");
		
	ИначеЕсли ТипБП = "СделкиРЕПО" Тогда
		
		МассивШагов.Добавить("УстановкаНастроекБП");
		МассивШагов.Добавить("ПерваяЧастьРЕПО");
		МассивШагов.Добавить("ОплатаКомиссииБиржиПерваяЧасть");
		МассивШагов.Добавить("ОплатаКомиссииБрокераПерваяЧасть");
		МассивШагов.Добавить("ОплатаПервойЧастиСделкиЧерезБрокера");
		МассивШагов.Добавить("ВтораяЧастьРЕПО");
		МассивШагов.Добавить("ОплатаКомиссииБиржиВтораяЧасть");
		МассивШагов.Добавить("ОплатаКомиссииБрокераВтораяЧасть");
		МассивШагов.Добавить("ОплатаВторойЧастиСделкиЧерезБрокера");
		
	// IMAPPS-32494 ++
	ИначеЕсли ТипБП = "СделкиНаСрочномРынке" Тогда
		
		МассивШагов.Добавить("УстановкаНастроекБП");
		МассивШагов.Добавить("ПроведениеСделкиНаСрочномРынке");
		МассивШагов.Добавить("ОплатаКомиссииБиржи");
		МассивШагов.Добавить("ОплатаКомиссииБрокера");
	// IMAPPS-32494 --
	
	КонецЕсли;
	
	Возврат МассивШагов;
	
КонецФункции // ПолучитьШагиБПДляЗакрытия()

Процедура Выполнение_СтартНовыхБАПослеЗагрузки(СтрокаДанные)
	
	БПСсылка 	= СтрокаДанные.ОбъектДляОперации;
	ТипБП 		= БПСсылка.Метаданные().Имя;
	Ошибки 		= Ложь; 

	Попытка
		
		БПОбъект = БПСсылка.ПолучитьОбъект();
		БПОбъект.Записать();
		Сообщить("Записан бизнес-процесс """+БПСсылка+""""+" "+ТекущаяДата());
		
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось записать бизнес-процесс """+БПСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);		
		Ошибки = Истина;
		
		////////// VTB-Borisov  - 18.04.2019 { 
		//////////какая-то непонятная ситуация когда в приемнике нет объекта по ссылке. 
		//////////пока делаем костыль
		////////Если Найти(ТекстСообщенияОбОшибке, "Объект не найден") <> 0 Тогда
		////////	Возврат;
		////////КонецЕсли;
		////////// VTB-Borisov  - 18.04.2019 }

	КонецПопытки;
	
	Если Не БПСсылка.ПометкаУдаления И Не Ошибки Тогда
		ТекстСообщенияОбОшибке = "";
		БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"Старт");
		// AVANCORE  - 18.10.2017 { 
		БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"УстановкаНастроекБП");
		ЗавершенныеШаги = Ложь;
		// AVANCORE  - 18.10.2017 } 
		
		ТекущиеТочки = ПолучитьТекущиеШагиБП(БПСсылка, ЗавершенныеШаги);

		Если ТипБП <> "СделкиРЕПО" Тогда
			Если ТекущиеТочки.Найти("Открытие плановой позиции") = Неопределено Тогда 
				ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Старт";
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецЕсли;
			
			
			Если ТипБП <> "ВнебиржеваяСделка" Тогда   
				БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"ОткрытиеПлановойПозиции");
				
				ТекущиеТочки = ПолучитьТекущиеШагиБП(БПСсылка, ЗавершенныеШаги);
				
				Если ТекущиеТочки.Найти("Перерегистрация ц/б") = Неопределено Тогда 
					ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Открытие плановой позиции";
					Сообщить(ТекстСообщенияОбОшибке);		
					Ошибки = Истина;
				КонецЕсли;
			КонецЕсли;
				
		Иначе
			Если ТекущиеТочки.Найти("1-я часть РЕПО") = Неопределено Тогда 
				ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Старт";
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке);

КонецПроцедуры // Выполнение_СтартНовыхБАПослеЗагрузки()

Процедура Выполнение_ЗавершениеНовыхБППослеЗагрузки(СтрокаДанные)

	БПСсылка 	= СтрокаДанные.ОбъектДляОперации;
	ТипБП 		= БПСсылка.Метаданные().Имя;
	Ошибки	 	= Ложь; 

	Попытка
		БПОбъект = БПСсылка.ПолучитьОбъект();
		БПОбъект.Записать();
		Сообщить("Записан бизнес-процесс """+БПСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось записать бизнес-процесс """+БПСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
		
		//////// VTB-Borisov  - 18.04.2019 { 
		////////какая-то непонятная ситуация когда в приемнике нет объекта по ссылке. 
		////////пока делаем костыль
		//////Если Найти(ТекстСообщенияОбОшибке, "Объект не найден") <> 0 Тогда
		//////	Возврат;
		//////КонецЕсли;
		//////// VTB-Borisov  - 18.04.2019 }

	КонецПопытки;
	
	// AVANCORE  - 31.10.2017 {
	
	МассивШагов = Новый Массив;
	
	Если Не БПСсылка.ПометкаУдаления И не Ошибки Тогда
		ТекстСообщенияОбОшибке = "";
		БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"Старт");
		Если НЕ БПСсылка.Стартован Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" " + "Старт";
			Сообщить(ТекстСообщенияОбОшибке);		
			Ошибки = Истина;
		КонецЕсли;
		
		// AVANCORE  - 31.10.2017 {

		МассивШагов = ПолучитьШагиБПДляЗакрытия(ТипБП);
			
		// AVANCORE  - 31.10.2017 }
		
		
		Для Каждого Шаг Из МассивШагов Цикл
			Если  Ошибки Тогда 
				Прервать; 
			КонецЕсли;
			
			Попытка
				БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка, Шаг);
			Исключение
				ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" " + Шаг;
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецПопытки;
		КонецЦикла;
		Если Не Ошибки И НЕ БПСсылка.Завершен Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось завершить бизнес-процесс """+БПСсылка+"""";
			Сообщить(ТекстСообщенияОбОшибке);		
			Ошибки = Истина;
		КонецЕсли;
	КонецЕсли;
	// AVANCORE  - 31.10.2017 }
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке);

КонецПроцедуры // Выполнение_ЗавершениеНовыхБППослеЗагрузки()

Процедура Выполнение_УдалениеНовыхБППослеЗагрузки(СтрокаДанные)

	БПСсылка 	= СтрокаДанные.ОбъектДляОперации;
	ТипБП 		= БПСсылка.Метаданные().Имя;
	Ошибки	 	= Ложь; 

	Попытка
		БПОбъект = БПСсылка.ПолучитьОбъект();
		БПОбъект.ПометкаУдаления = Истина;
		БПОбъект.Завершен = Ложь;
		БПОбъект.Стартован = Ложь;
		БПОбъект.ДатаЗавершения = '00010101';
		БПОбъект.Записать();
		Сообщить("Записан бизнес-процесс """+БПСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось записать бизнес-процесс """+БПСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
		
		////////// VTB-Borisov  - 18.04.2019 { 
		//////////какая-то непонятная ситуация когда в приемнике нет объекта по ссылке. 
		//////////пока делаем костыль
		////////Если Найти(ТекстСообщенияОбОшибке, "Объект не найден") <> 0 Тогда
		////////	Возврат;
		////////КонецЕсли;
		////////// VTB-Borisov  - 18.04.2019 }

	КонецПопытки;  
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке); 
	
КонецПроцедуры // Выполнение_УдалениеНовыхБППослеЗагрузки()

Процедура Выполнение_ИзменениеБППослеЗагрузки(СтрокаДанные)

	БПСсылка 	= СтрокаДанные.ОбъектДляОперации;
	ТипБП 		= БПСсылка.Метаданные().Имя;
	Ошибки	 	= Ложь; 

	Попытка
		БПОбъект = БПСсылка.ПолучитьОбъект();
		БПОбъект.Записать();
		Сообщить("Записан бизнес-процесс """+БПСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось записать бизнес-процесс """+БПСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
		
		//////// VTB-Borisov  - 18.04.2019 { 
		////////какая-то непонятная ситуация когда в приемнике нет объекта по ссылке. 
		////////пока делаем костыль
		//////Если Найти(ТекстСообщенияОбОшибке, "Объект не найден") <> 0 Тогда
		//////	Возврат;
		//////КонецЕсли;
		//////// VTB-Borisov  - 18.04.2019 }

	КонецПопытки;
	
	Если БПСсылка.Стартован Тогда
		Попытка
			БизнесПроцессы[ТипБП].ОтменитьШагиБизнесПроцессаАвтоматически(БПСсылка);
			Сообщить("Отменены шаги по бизнес-процессу """+БПСсылка+"""");
		Исключение
			ТекстСообщенияОбОшибке = ("!!! Не удалось отменить шаги по бизнес-процессу """+БПСсылка+""" по причине: "+ОписаниеОшибки());
			Сообщить(ТекстСообщенияОбОшибке);
			Ошибки = Истина;
		КонецПопытки;
	КонецЕсли;
	
	// AVANCORE  - 15.08.2017 { Не стартованные бизнес-процессы не запускаем в приемнике.
	
	Если Не БПОбъект.ПометкаУдаления И Не Ошибки Тогда
		ТекстСообщенияОбОшибке = "";
		Если ТипБП = "ВнебиржеваяСделка" Или Не БПСсылка.Стартован Тогда
			БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"Старт");
		Иначе
			БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"УстановкаНастроекБП");
		КонецЕсли;
		ЗавершенныеШаги = Ложь;
		// AVANCORE  - 14.04.2017 { 

		ТекущиеТочки = ПолучитьТекущиеШагиБП(БПСсылка, ЗавершенныеШаги);
		
		Если ТипБП <> "СделкиРЕПО" Тогда
			Если ТекущиеТочки.Найти("Открытие плановой позиции") = Неопределено Тогда 
				ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Установка настроек БП";
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецЕсли;
			БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"ОткрытиеПлановойПозиции");
			
			// AVANCORE  - 14.04.2017 { 

			ТекущиеТочки = ПолучитьТекущиеШагиБП(БПСсылка, ЗавершенныеШаги);
			
			Если ТекущиеТочки.Найти("Перерегистрация ц/б") = Неопределено Тогда 
				ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Открытие плановой позиции";
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецЕсли;
		Иначе
			Если ТекущиеТочки.Найти("1-я часть РЕПО") = Неопределено Тогда 
				ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Установка настроек БП";
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке); 

КонецПроцедуры // Выполнение_ИзменениеБППослеЗагрузки()

Процедура Выполнение_СтартИзмененныхБППослеЗагрузки(СтрокаДанные)

	БПСсылка 		= СтрокаДанные.ОбъектДляОперации;
	ТипБП 			= БПСсылка.Метаданные().Имя;
	Ошибки 			= Ложь; 
	
	//{[+] IMDEV-4941 N.Filimonova 14.08.2023 
	ПройденныеШагиСтрокой 	= СтрокаДанные.ПройденныеШаги;  
	ПройденныеШаги = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПройденныеШагиСтрокой, ";", Истина); 
	//} IMDEV-4941 N.Filimonova
	
	Попытка
		БПОбъект = БПСсылка.ПолучитьОбъект();
		БПОбъект.Записать();
		Сообщить("Записан бизнес-процесс """+БПСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось записать бизнес-процесс """+БПСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
		
		// VTB-Borisov  - 18.04.2019 { 
		//какая-то непонятная ситуация когда в приемнике нет объекта по ссылке. 
		//пока делаем костыль
		Если Найти(ТекстСообщенияОбОшибке, "Объект не найден") <> 0 Тогда
			Возврат;
		КонецЕсли;
		// VTB-Borisov  - 18.04.2019 }

	КонецПопытки;
	
	// AVANCORE  - 31.10.2017 {
	ЗавершенныеШаги = Истина;    // AVANCORE  - 18.10.2017
	
	ТекущиеТочки = ПолучитьТекущиеШагиБП(БПСсылка, ЗавершенныеШаги);  // AVANCORE - 13.08.2017
	// AVANCORE  - 31.10.2017 }
	
	Если БПСсылка.Стартован Тогда
		Попытка
			БизнесПроцессы[ТипБП].ОтменитьШагиБизнесПроцессаАвтоматически(БПСсылка);
			Сообщить("Отменены шаги по бизнес-процессу """+БПСсылка+"""");
		Исключение
			ТекстСообщенияОбОшибке = ("!!! Не удалось отменить шаги по бизнес-процессу """+БПСсылка+""" по причине: "+ОписаниеОшибки());
			Сообщить(ТекстСообщенияОбОшибке);
		Ошибки = Истина;
		КонецПопытки;
	КонецЕсли;
	
	// AVANCORE  - 31.10.2017 {
	Если Не БПСсылка.ПометкаУдаления И Не Ошибки Тогда
		ТекстСообщенияОбОшибке = "";
		БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"Старт");
		// AVANCORE  - 18.10.2017 { 
		БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"УстановкаНастроекБП");
		ЗавершенныеШаги = Ложь;
		// AVANCORE  - 18.10.2017 } 
		
		ТекущиеТочки = ПолучитьТекущиеШагиБП(БПСсылка, ЗавершенныеШаги);
		
		Если ТипБП <> "СделкиРЕПО" Тогда
			Если ТекущиеТочки.Найти("Открытие плановой позиции") = Неопределено Тогда 
				ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Старт";
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецЕсли;
			БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"ОткрытиеПлановойПозиции");
			
			ТекущиеТочки = ПолучитьТекущиеШагиБП(БПСсылка, ЗавершенныеШаги);
			
			Если ТекущиеТочки.Найти("Перерегистрация ц/б") = Неопределено Тогда 
				ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Открытие плановой позиции";
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецЕсли; 
			
			
			//{[+] IMDEV-4941 N.Filimonova 14.08.2023 
			Если ТипБП = "ВнебиржеваяСделка" Тогда
					
					МассивШагов = ПолучитьШагиБПДляЗакрытия(ТипБП);
	
					Для Каждого Шаг Из МассивШагов Цикл
						Если  Ошибки Тогда 
							Прервать; 
						КонецЕсли;
						
						Если ПройденныеШаги.Найти(Шаг) = Неопределено Тогда
							Продолжить;
						КонецЕсли;	
						
						Попытка
							БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка, Шаг);
						Исключение
							ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" " + Шаг;
							Сообщить(ТекстСообщенияОбОшибке);		
							Ошибки = Истина;
						КонецПопытки;
					КонецЦикла;
					
			КонецЕсли;		
			//} IMDEV-4941 N.Filimonova
			
		Иначе
			Если ТекущиеТочки.Найти("1-я часть РЕПО") = Неопределено Тогда 
				ТекстСообщенияОбОшибке =ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" Старт";
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// AVANCORE  - 31.10.2017 }  
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке); 

КонецПроцедуры // СтартИзмененныхБППослеЗагрузки()

Процедура Выполнение_ЗавершениеБППослеЗакрытия(СтрокаДанные)

	БПСсылка 	= СтрокаДанные.ОбъектДляОперации;
	ТипБП 		= БПСсылка.Метаданные().Имя;
	Ошибки 		= Ложь;

	Попытка
		БПОбъект = БПСсылка.ПолучитьОбъект();
		БПОбъект.Записать();
		Сообщить("Записан бизнес-процесс """+БПСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось записать бизнес-процесс """+БПСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);		
		Ошибки = Истина;
		
		// VTB-Borisov  - 18.04.2019 { 
		//какая-то непонятная ситуация когда в приемнике нет объекта по ссылке. 
		//пока делаем костыль
		Если Найти(ТекстСообщенияОбОшибке, "Объект не найден") <> 0 Тогда
			Возврат;
		КонецЕсли;
		// VTB-Borisov  - 18.04.2019 }

	КонецПопытки;
	
	// AVANCORE  - 31.10.2017 {
	ЗавершенныеШаги = Истина;    // AVANCORE  - 18.10.2017            	
	// AVANCORE  - 31.10.2017 }
	
	Если БПСсылка.Стартован Тогда
		Попытка 
			// IMDEV-8772 ++
			// Для БП СделкиTn используем специальный вариант отмены шагов:
			// он сохраняет проведение документа Сделка и исключает повторное проведение.
			БезОтменыПроведенияСделки = ТипБП = "СделкиTn" И Не БПСсылка.ПометкаУдаления И Не Ошибки;
			Если БезОтменыПроведенияСделки Тогда
				БизнесПроцессы[ТипБП].ExchDU_ОтменитьШагиБизнесПроцессаАвтоматически(БПСсылка, БезОтменыПроведенияСделки);
			Иначе
				// Для остальных БП сохраняем стандартный механизм отмены шагов.
				БизнесПроцессы[ТипБП].ОтменитьШагиБизнесПроцессаАвтоматически(БПСсылка);
			КонецЕсли;
			// IMDEV-8772 --
			Сообщить("Отменены шаги по бизнес-процессу """+БПСсылка+""""+" "+ТекущаяДата());
		Исключение
			ТекстСообщенияОбОшибке = ("!!! Не удалось отменить шаги по бизнес-процессу """+БПСсылка+""" по причине: "+ОписаниеОшибки());
			Сообщить(ТекстСообщенияОбОшибке);		
			Ошибки = Истина;
		КонецПопытки;
	КонецЕсли;
	
	// AVANCORE  - 13.07.2017 {
	Если Не БПСсылка.ПометкаУдаления И Не Ошибки Тогда
		ТекстСообщенияОбОшибке = "";
		// AVANCORE  - 31.10.2017 {
		Если НЕ БПСсылка.Стартован Тогда
			БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка,"Старт");
		КонецЕсли;
		Если НЕ БПСсылка.Стартован Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" " + "Старт";
			Сообщить(ТекстСообщенияОбОшибке);		
			Ошибки = Истина;
		КонецЕсли;
		
		МассивШагов = ПолучитьШагиБПДляЗакрытия(ТипБП);
		
		Для Каждого Шаг Из МассивШагов Цикл
			Если Ошибки Тогда 
				Прервать; 
			КонецЕсли;
			
			Попытка
				БизнесПроцессы[ТипБП].ВыполнитьШагБизнесПроцессаАвтоматически(БПСсылка, Шаг);
			Исключение
				ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось выполнить шаг бизнес-процесса """+БПСсылка+""" " + Шаг;
				Сообщить(ТекстСообщенияОбОшибке);		
				Ошибки = Истина;
			КонецПопытки;
		КонецЦикла;
		Если Не Ошибки И НЕ БПСсылка.Завершен Тогда
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке + Символы.ПС + "!!! Не удалось завершить бизнес-процесс """+БПСсылка+"""";
			Сообщить(ТекстСообщенияОбОшибке);		
			Ошибки = Истина;
		КонецЕсли;
		// AVANCORE  - 31.10.2017 }
	КонецЕсли;
	// AVANCORE  - 13.07.2017 }	
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке); 

КонецПроцедуры // Выполнение_ЗавершениеБППослеЗакрытия()
 
Процедура Выполнение_УдалениеБППослеЗагрузки(СтрокаДанные)

	БПСсылка 	= СтрокаДанные.ОбъектДляОперации;
	ТипБП 		= БПСсылка.Метаданные().Имя;
	Ошибки 	= Ложь; 

	Попытка
		БПОбъект = БПСсылка.ПолучитьОбъект();
		БПОбъект.ПометкаУдаления = Истина;
		БПОбъект.Завершен = Ложь;
		БПОбъект.Стартован = Ложь;
		БПОбъект.ДатаЗавершения = '00010101';
		БПОбъект.Записать();
		Сообщить("Записан с пометкой удаления бизнес-процесс """+БПСсылка+""""+" "+ТекущаяДата());
	Исключение
		ТекстСообщенияОбОшибке = ("!!! Не удалось записать бизнес-процесс """+БПСсылка+""" по причине: "+ОписаниеОшибки());
		Сообщить(ТекстСообщенияОбОшибке);		
		Ошибки = Истина;
		
		// VTB-Borisov  - 18.04.2019 { 
		//какая-то непонятная ситуация когда в приемнике нет объекта по ссылке. 
		//пока делаем костыль
		Если Найти(ТекстСообщенияОбОшибке, "Объект не найден") <> 0 Тогда
			Возврат;
		КонецЕсли;
		// VTB-Borisov  - 18.04.2019 }

	КонецПопытки;
	
	УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, Ошибки, ТекстСообщенияОбОшибке); 

КонецПроцедуры // Выполнение_УдалениеБППослеЗагрузки()

Процедура ЗаписьЛоговОбмена(ПараметрыОбработкиXML, ИдентификаторОбмена, ИдентификаторПотока) Экспорт
	//{[+] Рефакторинг N.Filimonova 01.03.2022
	
	ТаблицаЗагруженныхОбъектов 		= ПараметрыОбработкиXML.ТаблицаЗагруженныхОбъектов;
	ТаблицаНеЗагруженныхОбъектов    = ПараметрыОбработкиXML.ТаблицаНеЗагруженныхОбъектов; 
	
	// слишком много данных, можно брать их из других регистров
	////////Для Каждого СтрокаЗагруженныйОбъект Из ТаблицаЗагруженныхОбъектов Цикл
	////////	МенеджерЗаписи = РегистрыСведений.ExchDU_СостояниеОбъектовЗагрузки.СоздатьМенеджерЗаписи();
	////////	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаЗагруженныйОбъект);
	////////	МенеджерЗаписи.ИдентификаторОбмена = ИдентификаторОбмена;
	////////	МенеджерЗаписи.ИдентификаторПотока = ИдентификаторПотока;
	////////	МенеджерЗаписи.ДатаОбмена 		   = ТекущаяДата();
	////////	Попытка
	////////		МенеджерЗаписи.Записать();
	////////	Исключение
	////////		Сообщить(ОписаниеОшибки());
	////////	КонецПопытки;
	////////КонецЦикла;
	////////
	////////Для Каждого СтрокаНеЗагруженныйОбъект Из ТаблицаНеЗагруженныхОбъектов Цикл
	////////	МенеджерЗаписи = РегистрыСведений.ExchDU_СостояниеОбъектовЗагрузки.СоздатьМенеджерЗаписи();
	////////	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаНеЗагруженныйОбъект);
	////////	МенеджерЗаписи.ИдентификаторОбмена = ИдентификаторОбмена;
	////////	МенеджерЗаписи.ИдентификаторПотока = ИдентификаторПотока;
	////////	МенеджерЗаписи.ДатаОбмена 		   = ТекущаяДата();
	////////	Попытка
	////////		МенеджерЗаписи.Записать();
	////////	Исключение
	////////		Сообщить(ОписаниеОшибки());
	////////	КонецПопытки;
	////////КонецЦикла;

	Сообщения = ПолучитьСообщенияПользователю(Ложь);
	
	Если Сообщения.Количество() > 0 Тогда
		
		ТекстСообщений = "";
		
		МенеджерЗаписи = РегистрыСведений.ExchDU_СостояниеОбъектовЗагрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторОбмена = ИдентификаторОбмена;
		МенеджерЗаписи.ИдентификаторПотока = ИдентификаторПотока;
		МенеджерЗаписи.УИД 				   = Новый УникальныйИдентификатор;
		МенеджерЗаписи.ДатаОбмена 		   = ТекущаяДата();
		МенеджерЗаписи.Тип 		   		   = "Сообщения пользователю";
		МенеджерЗаписи.Представление 	   = "Сообщения пользователю";
	
		Для Каждого Сообщение Из Сообщения Цикл
			Если ЗначениеЗаполнено(Сообщение.Текст) Тогда
				ТекстСообщений = ТекстСообщений + Символы.ПС + Сообщение.Текст;
			КонецЕсли;	
		КонецЦикла;
		
		МенеджерЗаписи.Комментарий 	   = ТекстСообщений;
		
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	//} Рефакторинг N.Filimonova
КонецПроцедуры

Процедура УстановкаСтатусаОбработкиОбъекта(СтрокаДанные, БылиОшибки, Комментарий)     
	
		МенеджерЗаписи = РегистрыСведений[СтрокаДанные.РегСвед].СоздатьМенеджерЗаписи();
		МенеджерЗаписи[СтрокаДанные.Измерение] = СтрокаДанные.ОбъектДляОперации; 
		МенеджерЗаписи.ИдентификаторПотока = СтрокаДанные.ИдентификаторПотока;  
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда   
			МенеджерЗаписи.ДатаОбработки = ТекущаяДата();
			МенеджерЗаписи.Обработан = Не БылиОшибки;
			МенеджерЗаписи.Комментарий = СтрЗаменить(Комментарий, Символы.ПС, "");
			МенеджерЗаписи.Записать(); 
		КонецЕсли; 
		
КонецПроцедуры  
	
// IMAPPS-31910 ++
//Функция ДоступныеОбмены() Экспорт 
Функция ДоступныеОбмены(КоличествоПотоков) Экспорт 
// IMAPPS-31910 --

	Запрос = Новый Запрос;
	Запрос.Текст = 

// IMAPPS-31910 ++

		//"ВЫБРАТЬ
		//|	ExchDU_ПотокиОбмена.ИдентификаторОбмена КАК ИдентификаторОбмена,
		//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ExchDU_ПотокиОбмена.ИдентификаторПотока) КАК ПотоковВсего
		//|ПОМЕСТИТЬ ВТ_ПотокиВсего
		//|ИЗ
		//|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ExchDU_ПотокиОбмена.ИдентификаторОбмена
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ExchDU_ПотокиОбмена.ИдентификаторОбмена КАК ИдентификаторОбмена,
		//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ExchDU_ПотокиОбмена.ИдентификаторПотока) КАК ПотоковЗагружено
		//|ПОМЕСТИТЬ ВТ_ПотокиЗагружены
		//|ИЗ
		//|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
		//|ГДЕ
		//|	ExchDU_ПотокиОбмена.СостояниеОбработки = ЗНАЧЕНИЕ(Перечисление.ExchDU_СостояниеОбработки.Загружен)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ExchDU_ПотокиОбмена.ИдентификаторОбмена
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ДосупныеПотоки.ИдентификаторОбмена КАК ИдентификаторОбмена,
		//|	МИНИМУМ(ExchDU_ПотокиОбмена.ДатаОбмена) КАК ДатаОбмена
		//|ИЗ
		//|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ВТ_ПотокиВсего.ИдентификаторОбмена КАК ИдентификаторОбмена
		//|		ИЗ
		//|			ВТ_ПотокиВсего КАК ВТ_ПотокиВсего
		//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПотокиЗагружены КАК ВТ_ПотокиЗагружены
		//|				ПО ВТ_ПотокиВсего.ИдентификаторОбмена = ВТ_ПотокиЗагружены.ИдентификаторОбмена
		//|					И ВТ_ПотокиВсего.ПотоковВсего = ВТ_ПотокиЗагружены.ПотоковЗагружено) КАК ДосупныеПотоки
		//|		ПО ExchDU_ПотокиОбмена.ИдентификаторОбмена = ДосупныеПотоки.ИдентификаторОбмена
		//|ГДЕ
		//|	ExchDU_ПотокиОбмена.ДатаОбмена >= &ДатаОбмена
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ДосупныеПотоки.ИдентификаторОбмена
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ДатаОбмена УБЫВ";
		
"ВЫБРАТЬ
|	ExchDU_ПотокиОбмена.ИдентификаторОбмена КАК ИдентификаторОбмена,
|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ExchDU_ПотокиОбмена.ИдентификаторПотока) КАК ПотоковВсего,
|	МАКСИМУМ(ExchDU_ПотокиОбмена.ДатаОбмена) КАК ДатаОбмена
|ПОМЕСТИТЬ ВТ_ПотокиВсего
|ИЗ
|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
|ГДЕ
|	ExchDU_ПотокиОбмена.ДатаОбмена >= &ДатаОбмена
|
|СГРУППИРОВАТЬ ПО
|	ExchDU_ПотокиОбмена.ИдентификаторОбмена
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ExchDU_ПотокиОбмена.ИдентификаторОбмена КАК ИдентификаторОбмена,
|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ExchDU_ПотокиОбмена.ИдентификаторПотока) КАК ПотоковЗагружено
|ПОМЕСТИТЬ ВТ_ПотокиЗагружены
|ИЗ
|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
|ГДЕ
|	ExchDU_ПотокиОбмена.ДатаОбмена >= &ДатаОбмена
|	И ExchDU_ПотокиОбмена.СостояниеОбработки = ЗНАЧЕНИЕ(Перечисление.ExchDU_СостояниеОбработки.Загружен)
|
|СГРУППИРОВАТЬ ПО
|	ExchDU_ПотокиОбмена.ИдентификаторОбмена
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ_ПотокиВсего.ИдентификаторОбмена КАК ИдентификаторОбмена,
|	ВТ_ПотокиВсего.ПотоковВсего КАК ПотоковВсего,
|	ВТ_ПотокиВсего.ДатаОбмена КАК ДатаОбмена
|ИЗ
|	ВТ_ПотокиВсего КАК ВТ_ПотокиВсего
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПотокиЗагружены КАК ВТ_ПотокиЗагружены
|		ПО ВТ_ПотокиВсего.ИдентификаторОбмена = ВТ_ПотокиЗагружены.ИдентификаторОбмена
|			И ВТ_ПотокиВсего.ПотоковВсего = ВТ_ПотокиЗагружены.ПотоковЗагружено
|			И (ВТ_ПотокиВсего.ПотоковВсего = &КоличествоПотоков)
|
|УПОРЯДОЧИТЬ ПО
|	ДатаОбмена УБЫВ
|";

// IMAPPS-31910 --
	
	Запрос.УстановитьПараметр("ДатаОбмена", НачалоДня(ТекущаяДата()-24*3600)); 
	Запрос.УстановитьПараметр("КоличествоПотоков", КоличествоПотоков);      // IMAPPS-31910 
	ТаблицаРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
    Возврат ТаблицаРезультатЗапроса;
	
КонецФункции


Процедура УстановкаСостоянияОбмена(ИдентификаторОбмена, СостояниеОбработки) Экспорт
	
	Набор = РегистрыСведений.ExchDU_ПотокиОбмена.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторОбмена.Установить(ИдентификаторОбмена); 
	Набор.Прочитать();  
	
	Для Каждого ЗаписьНабора Из Набор Цикл
		   ЗаписьНабора.СостояниеОбработки = СостояниеОбработки;
	КонецЦикла;	
	   
	Набор.Записать();   

КонецПроцедуры

Процедура УстановкаСостоянияПотока(ИдентификаторПотока, СостояниеОбработки) Экспорт
	
	Набор = РегистрыСведений.ExchDU_ПотокиОбмена.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторПотока.Установить(ИдентификаторПотока); 
	Набор.Прочитать();  
	
	Для Каждого ЗаписьНабора Из Набор Цикл
		   ЗаписьНабора.СостояниеОбработки = СостояниеОбработки;
	КонецЦикла;	
	   
	Набор.Записать();   

КонецПроцедуры
